data_text_standart: dict = {
    "т1": "блюншж явфвн, бйёпнёж яиэбёйёнляёф! оплизкриоь о еэбэфвж, злабэ "
"кэ яштлбв квжнлккэь овпщ блидкэ яшбэяэпщ кв плищзл зиэоо(зиэооёсёзэуёь) "
"ё кв мнлопл фёоил (нванвооёь). кэ яштлбв крдкл ялеянэцэпщ x,y, width, height ё зиэоо люкэнрдвкклал кэ зэнпёкзв лючвзпэ (ёиё зллнбёкэпшплфвз злкпрнля ъплал лючвзпэ, э-иь овайвкпэуёь).",
    "т2": "эзъйфг эюжх. зйьщжвбщлзйф дмйкзы ийюэезавев люёф ийзюдлзы"
"из дмйкм ai, зжв ы щллщрю. цлз жюзъшбщлюехжфю люёф, ыф ёзаюлю"
"ыфъйщлх ечъмч кызч.",
    "т3": "зрмцфмн ёпдзмрмфтёмы, зиса зтефян. ря х ёдрм еихизтёдпм ут"
"очфхч фтхд отедпац. утпстъисстн уфтжфдрря рси сднцм си чздптха, пмьа"
"цтпаот офдцомн упдс очфхд:",
    "т4": "зтефян зиса. ёт ёпткисмм сдьи отррифыихоти уфизпткисми ут"
"утотумнстрч техпчкмёдсмв. д цдоки хумхто у физтхцдёпгирящ сдрм чхпчж."
"ечзир фдзя здпасиньирч уптзтцётфстрч хтцфчзсмыихцёч!",
    "т5": "сьоюьт баюь. обсйат сьоюи этютшцыбай каьа внчщ ын ятюптю."
"каь сщм ныыи п кщтшаюцшб ьэцяныцт ыьътышщнабюи ынсь хнамыбай.",
    "т6": "упьлнэюняхюр, пшфюьфх! шрщк уъняю щлюлчзк эрьоррнщл. к"
"кнчкйэз ъафвфлчзщжш ыьрпэюлнфюрчршцьяыщъх ыьъфунъпэюнрщщъ-"
"чъофэюфгрэцъх цъшылщфф. улщфшлршэк ыъэюлнцлшфыъ йоя ьъээфф.",
    "т7": "тэпяйш туьк. рэ юуярйд samsung ai юяэрэтчб тън ьо 10сэ ыоабуящъоаа р ысв. ",
    "т8": "ощлыёф мпвпы, очуэыуф мцкоучуыщмув! ъщоьхксуэп, хщнок ю"
"шкь люопэ ьцпоюидпп ткшйэуп?",
    "т9": "ощлыёф опшж. мкг ъщвэщмёф йдух кхэумуыщмкцу.",
    "т10": "чвфдоэ чшбп, жхуъушаоэ юяьшбё ! х гдвчвяъшбьш булшцв е хуаь"
"чьуявцу- бугдухятс булш гдшчявъшбьш гв гвчюяскшбьс ьбёшдбшёу чят хулшэ"
"вдцубьыуйьь!"
}

data_text: dict = {
        "т1": """обнмчшйчшенчё мса амнбчцжц вмнбыуршчуа рнбцалчцжц
обцлурчущш у бньнчуа  влбшлнжуенвщую, цонбшлурчц-влбшлнжуенвщую у
цонбшлурчёю йшмше чш щцчлучнчлшсхчёю, цщншчвщую (гцбвщую)
лншлбшю рцнччёю мнэвлруэ (лрм) у чш цлмнсхчёю влбшлнжуенвщую
(цонбшяуцччёю) чшобшрснчуаю. арсазлва ешвлхз «амнбчцэ лбушмё». щ
цвчцрчёг оцлнчяушсхчёг йшмшешг швав цлчцвалва: чшчнвнчун
бшщнлчцдцгдцрёю фмшбцр оц цдтнщлшг обцлурчущш чш йчшеулнсхчёю
фмшснчуаю цл шибцмбцгцр дшйубцршчуа, цднвоненчун оцммнбыщу в
рцймфюш вус цдкнжц чшйчшенчуа (вцч) у мб. швав веулшзлва жудщуг
вбнмвлрцг щшщ жсцдшсхчцжц, лшщ у бнжуцчшсхчцжц вмнбыуршчуа
рнбцалчёю обцлурчущцр, гцжфл обугнчалхва рц рвню румшю рцэч у
щцчъсущлцр (щшщ амнбчёю, лшщ у цдёечёю). швав угнзлва р вцвлшрн ррв
бцввуу, вьш у щулша.р вьш цвчцрф швав вцвлшрсазл лаынсён
(влбшлнжуенвщун) дцгдшбмубцркущу (лд, вг. лаынсёэ дцгдшбмубцркущ) р-52ч
у р-2ш, врнмнччён р 5 шрушщбёсхнр р вцвлшрн 8-э у 12-э рцймфьчёю шбгуэ,
щцлцбён шмгучувлбшлурчц оцмеучнчё дцнрцгф шрушяуцччцгф
щцгшчмцршчуз ррв вьш. чш рццбфынчуу лд чшюцмалва щбёсшлён бшщнлё
(вг. щбёсшлша бшщнлш) рцймфьчцжц дшйубцршчуа (щбрд) дцсхьцэмшс чцвлу (р амнбчцг у чнамнбчцг цвчшкнчуу) у шрушдцгдё. р фвсцруаю ��
губчцжц рбнгнчу дцнрцн мныфбвлрц влбшлнжуенвщцэ дцгдшбмубцрцечцэ
шрушяунэ (вдш) вьш чн цвфкнвлрсанлва. в янсхз оцммнбышчуа
обшщлуенвщую чшрёщцр снлчцжц вцвлшрш цбжшчуйфзлва оцснлё оц осшчшг
дцнрцэ оцмжцлцрщу. р фжбцышнгёэ онбуцм бшйрулуа рцнччц-оцсулуенвщцэ
цдвлшчцрщу усу р щбуйувчёю вулфшяуаю вдш онбнмшнлва р цонбшлурчцн
оцмеучнчун цдтнмучнччцгф влбшлнжуенвщцгф щцгшчмцршчуз рццбфынччёю
вус (рв) вьш усу щцгшчмфзкнгф цдтнмучнччцжц щцгшчмцршчуа чш лрм.
цвчцрчён чшобшрснчуа бшйрулуа  вав рв вьш: гцмнбчуйшяуа у обцмснчун ��
вбцщш ищвосфшлшяуу лд р-52ч у р-2ш; обучалун чш рццбфынчун чцрёю
луоцр рёвцщцлцечёю щбрд, шрушдцгд у лд чцрцжц оцщцснчуа щ 2040 ж.""",
        "т2": """ шцагщг иахшцкихпг м агюбцгэ ы бюпгшцх гцбэщбу фщъайъцхмх
ы мбщжъ 1940-е йй. иах гмцхыщбэ клгшцхх клъщче, хээхйахабыгытхе хё
йъаэгщхх. ш шгэбйб щглгпг акмбыбьшцыб гайъщцхщч шцаъэхпбшо ьбюхцошд
ы дьъащбу бюпгшцх эгмшхэгпощбу щъёгыхшхэбшцх, иах мбцбабу ыбёэбрщб
бьщбыаъэъщщбъ агёыхцхъ гцбэщбу фщъайъцхмх х щгклщб-цъещхлъшмбйб
ибцъщжхгпг ы бюпгшцх дьъащбйб цбипхыщбйб жхмпг (дцж), ьбпйбъ ыаъэд
бшцгыпдд бцмачцчэ ыбиабш ъйб хшибпоёбыгщхд ы ыбъщщче жъпде.ы 1953 й.
ы гайъщцхщъ щглгпхшо агюбцч иб иабэчтпъщщбу ьбючлъ кагщг. ёг 1958–1972
йй. ючпх ыыъьъщч ы фмшипкгцгжхн лъцчаъ хшшпъьбыгцъпошмхе аъгмцбаг,бьхщ хё мбцбаче ючп хэибацхабыгщ хё штг, бшцгпощчъ шмбщшцакхабыгщч х
ибшцабъщч шбюшцыъщщчэх шхпгэх. ы 1969 й. ы фшъушъ, ы 40 мэ бц
шцбпхжч гайъщцхщч юкфщбш-гуаъшг, ючпг икяъщг пгюбагцбащгд
кшцгщбымг иб агьхбехэхлъшмбу иъаъагюбцмъ бюпклъщщбйб дьъащбйб
цбипхыг (бдц), щб ы 1973 й. ибшпъ ычьъпъщхд бм. 1 мй ипкцбщхд бщг ючпг
ьъэбщцхабыгщг. ы 1974 й. ы пхэъ, ы 100 мэ м шъыъак бц юкфщбш-гуаъшг,
ючпг икяъщг иъаыгд гцбэщгд фпъмцабшцгщжхд (гфш) «гцклг-1»,
ибшцабъщщгд иах ибэбях щъэъжмбу мбэигщхх «шхэъщш». гфш ючпг шбёьгщг
щг бшщбыъ цдръпбыбьщ йб аъгмцбаг щг иахабьщбэ кагщъ фпъмцахлъшмбу ��
эбящбшцон 357 эыц.""",
    "т3": """жфяюфялав  уфяда ъ  вяиелфй  злиекиымшиъдфй  щъыалфюдфй.
ажу жфяеаряиувтыъв ла ъыеаыикмшиъдми м слфкфпиуиюци.д
ъыеаыикмшиъдмс фылфъвыъв ажу, фълфюлцс юффещнилмис дфыфецх
вюувтыъв чауумъымшиъдми еадиыц ъыеаыикмшиъдфкф ларлашилмв (чежу). ю
сфеъдмх ъыеаыикмшиъдмх вяиелцх ъмуах (съвъ) юффещниллцх ъму (юъ) ег
жемлвыф мъжфуьрфюаыь ыиесмл «еадиылцй жфяюфялцй деийъие
ъыеаыикмшиъдфкф ларлашилмв» (еждъл). ю юфиллф-сфеъдмх ъмуах (юсъ) ъёа
м яещкмх кфъщяаеъыю щжфыеичувиыъв ыиесмл «аыфслав жфяюфялав уфяда
ъ чауумъымшиъдмсм еадиыасм» (жуаеч). флм жеияларлашилц яу��
жфеанилмв юанлцх юфиллф-аясмлмъыеаымюлцх пилыефю, жщлдыфющжеаюуилмв, кещжжмефюфд юффещниллцх ъму жефымюлмда, юфиллф-
сфеъдмх чар, жфеыфю м яе., фъщбиъыюувв жуаюалми ю утчцх еайфлах
смефюфкф фдиала ъдецылф, ли юъжуцюав ю лаяюфялфи жфуфнилми.еждъл м
жуаеч жемсилвтыъв дад ъасфъыфвыиуьлф, ыад м ю ъфъыаюи кещжжмефюфд
съвъ м еарлфефялцх ъму. сфкщы мсиыь ла юффещнилмм зггидымюлци
ъеияъыюа чфеьчц ъ жефымюфуфяфшлцсм ъмуасм жефымюлмда, ъеияъыюа
лачутяилмв, ъюврм м щжеаюуилмв, лаюмкапмм, юфъжеибилмв
лиъалдпмфлмефюаллфкф яфъыщжа д еадиылф-вяиелфсщ фещнмт, яещкми
еаямфзуидыефллци юцшмъумыиуьлци м ыихлмшиъдми ъеияъыюа.
ъыеаыикмшиъдми  ажу вюувтыъв  фълфюлфй  чфиюфй  иямлмпий м щяаелцс
дфсжфлилыфс съвъ м ъфъыфвы ла юффещнилмм юсг ефъъмм, юсъ ъёа,
юиумдфчемыалмм, геалпмм м дмыав.""",
        "т4": """чъуэлбх юрбэёдщябжп йдуэл скрёбжхж идёскд, ьвщайрблр ь
вжбуэёъвюла скрёбжхж идёскд (си) вжеодвэбжхж крпэрёлпэёлэлрьжхж (d-t)
ъищд. ожувжщявъ ь си ътр ьувжёр ожущр кжуэлтрблс бдквёлэлйбжуэл
крщсцeхжус едэрёлдщд (ке, уе. крщсцлрус едэрёлдщн) ь оёжюруур юробжп
ёрдвюлл крщрблс ежхъэ кжуэлхдэяус эреорёдэъён ожёсквд 107°у л кдьщрблр
108…109 дэе., ь гэлм ъущжьлсм ежхъэ оёжлумжклэя эрёежскрёбнр ёрдвюлл.
оёл оёжэрвдблл ёрдвюлл d-э-улбэрид леоъщяубж ьнкрщсаэус
ьнужвжгбрёхрэлйрувлр (14,7 егь) брпэёжбн, вжэжёнр гззрвэльбж ёдуцрощсаэскёд ке.ч. юрбэёдщябжп йдуэл идёскд эдщж ьдтбне фдхже ьорёрк оёл ��
ужьрёфрбуэьжьдблл скрёбжхж жёътлс (сж). ьж-орёьнм, ч. ибдйлэрщябж
ъьрщлйльдрэ гззрвэльбжуэя луожщяижьдблс ке. ь йлуэж крщлэрщябнм идёскдм
гззрвэльбжуэя жхёдблйрбд ужуэжсблре вёлэлйбжуэл ке. бдщлйлр тр оёл ч. си
«ьбрфблм» эрёежскрёбнм брпэёжбжь крщдрэ ёртле ухжёдблс ке
едщжйъьуэьлэрщябне в рхж ужуэжсбла, д вжщлйруэьж рхж ёдуцрольфлмус
скрё ёривж ьжиёдуэдрэ. ьж-ьэжёнм, бдщлйлр ч. ожьнфдрэ ъуэжпйльжуэя
гбрёхжьнкрщрблс си в оёркрэжбдюлл, йэж ожьнфдрэ оёркувдиърежуэя
жубжьбнм мдёдвэрёлуэлв идёскд (йэж ь жужчрббжуэл ьдтбж кщс орёьлйбнм
крщлэрщябнм ъищжь уэдклпбжхж эрёежскрёбжхж жёътлс). оёлербрблр ч. эдвтр
ьдтбж кщс ожьнфрблс гззрвэльбжуэл сж ь ъущжьлсм ьжикрпуэьлс бд брхж
уёркуэь скрёбжп оёжэльжёдврэбжп жчжёжбн (оёж) ид уйрэ жущдчщрблс
йъьуэьлэрщябжуэл си в ьжиблвдацреъ оёл гэже ь ке зжбъ идодикньдацлм
брпэёжбжь.""",
        "т5": """24 юхпзкиек 1969 т. юэеэк жогхеаэуо йевнхрёеф, югкжоппфх ю
еозэдэмонэхы рвтвгвео в пхеоюйевюзеопхп ээ крхепвтв веёъэк (рпкв). юйёюзк
ивухх 22 ухз, 18 щок 1992 т. рук юэеээ гюзёйэув г юэуё ювтуоахпэх в
гюхвибхщуяшэц тоеопзэкц щотозь. г 1976 т. ифуо вюпвгопо юэеэыюмок
мвщэююэк йв озвщпвы ьпхетээ (юмоь), врпвы эж нхухы мвзвевы ифув
эжёсхпэх гвжщвъпвюзэ юзевэзхучюзго по зхееэзвеээ юзеопф озвщпвыьухмзевюзопнээ (оью). г посоух 1980-ц тт. юэеэыюмок юзвевпо йевгврэуо
йхехтвгвеф ю деопнэхы в юзевэзхучюзгх ахюзэ ьпхетвиувмвг щвшпвюзчя 600
щгз  моърфы. йуопэевгоувюч, сзв  йхегфы ехомзве  иёрхз  жойёшхп  г 1991  т.
врпомв юрхумо зом э пх ифуо жогхеахпо.пхвицврэщвюзч ювжропэк
понэвпоучпвы иожф рук йвртвзвгмэ юйхнэоуэюзвг г виуоюзэ озвщпвы
ьпхетхзэмэ жоюзогэуо юмоь жопкзчюк йвэюмвщ юзеопф, мвзвеок йвюзогэуо
иф эююухрвгозхучюмэы ехомзве г юэеэя. г 1991 т. г мэзох йеэ юврхыюзгээ
щотозь ифу йеэвиехзхп щэпэозяепфы эюзвспэм пхызевпвг щвшпвюзчя 30 мгз,
мвзвефы ю 1998 т. йеэщхпкхзюк рук йевэжгврюзго юзоиэучпфц эжвзвйвг,
эюйвучжёяшэцюк г щхрэнэпх, о зомъх рук эжёсхпэк пхызевппфц
цоеомзхеэюзэм. йоеоуухучпв юмоь йевгврэуэюч йхехтвгвеф ю оетхпзэпвы в
йвмёймх ухтмвгврпвтв эююухрвгозхучюмвтв ехомзвео щвшпвюзчя 10 щгз.
врпомв йвр рогухпэхщ юв юзвевпф юао э эжеоэук юрхумо зом э пх
ювюзвкуоюч. г 1995–1999 тт. евююэхы э юэеэхы виюёъроуюк гвйевю
юзевэзхучюзго г йвюухрпхы поёспв-эююухрвгозхучюмвтв нхпзео ю
ухтмвгврпфщ крхепфщ ехомзвевщ щвшпвюзчя 25 щгз, о зомъх оью. врпомв йв
еожпфщ йеэсэпощ йеомзэсхюмвтв еожгэзэк ьзэ виюёърхпэк пх йвуёсэуэ.  """,
    }

data_char: list = [
        {'о':0.1023,'и':0.0873,'а':0.0834 ,'н':0.0801,'е':0.0752,'в':0.0621,'с':0.0602,'т':0.0562,'р':0.0497,'к': 0.0347,'я':0.0334,'д':0.0327,'м':0.0242,'ы':0.0235,'б':0.0229,'л':0.0229,'п':0.0203,'х':0.0196,'г':0.0157,'у':0.0150,'ч':0.0137,'з':0.0098,'й':0.0098,'ь':0.0078,'ж':0.0072,'ю':0.0065,'ш':0.0065,'ц':0.0052,'щ':0.0039,'ъ':0.0020,'э':0.0013,'ф':0.0007,'ё':0.0001},
        {'о':0.1173,'а':0.0880,'н':0.0775 ,'и':0.0733,'е':0.0723,'т':0.0608,'р':0.0566,'с':0.0555,'в':0.0471,'л': 0.0398,'м':0.0346,'к':0.0314,'п':0.0272,'г':0.0262,'ы':0.0251,'б':0.0199,'я':0.0199,'у':0.0188,'д':0.0178,'й':0.0126,'ч':0.0126,'э':0.0105,'ц':0.0094,'х':0.0094,'з':0.0094,'ь':0.0084,'щ':0.0042,'ш':0.0031,'ж':0.0021,'ю':0.0021,'ф':0.0013,'ъ':0.0007,'ё':0.0001},
        {'о':0.0973,'и':0.0873,'н':0.0802 ,'е':0.0766,'с':0.0713,'а':0.0686,'р':0.0651,'т':0.0571,'в':0.0517,'к': 0.0375,'л':0.0348,'я':0.0339,'п':0.0312,'д':0.0285,'м':0.0268,'ы':0.0205,'у':0.0187,'г':0.0169,'х':0.0152,'ч':0.0134,'б':0.0116,'й':0.0089,'ж':0.0080,'з':0.0071,'ю':0.0062,'ц':0.0054,'ь':0.0054,'ф':0.0045,'э':0.0027,'ш':0.0018,'щ':0.0018,'ъ':0.0007,'ё':0.0001},
        {'о':0.0989,'е':0.0938,'и':0.0810 ,'т':0.0735,'н':0.0627,'а':0.0596,'р':0.0586,'с':0.0519,'в':0.0502,'я': 0.0400,'д':0.0374,'л':0.0323,'к':0.0281,'м':0.0247,'п':0.0247,'з':0.0196,'ы':0.0187,'у':0.0179,'г':0.0170,'ч':0.0170,'ь':0.0136,'х':0.0136,'й':0.0111,'ж':0.0085,'б':0.0077,'ц':0.0077,'э':0.0077,'ф':0.0077,'ю':0.0060,'ш':0.0060,'щ':0.0051,'ъ':0.0007,'ё':0.0001},
        {'о':0.1028,'и':0.0818,'а':0.0804 ,'с':0.0737,'е':0.0706,'т':0.0656,'н':0.0609,'р':0.0601,'л':0.0430,'в': 0.0406,'к':0.0349,'д':0.0284,'п':0.0260,'я':0.0252,'г':0.0235,'м':0.0219,'й':0.0187,'ы':0.0179,'ь':0.0154,'з':0.0146,'б':0.0138,'у':0.0122,'э':0.0097,'ц':0.0073,'ч':0.0073,'ю':0.0065,'х':0.0065,'ж':0.0057,'щ':0.0057,'ш':0.0041,'ф':0.0016,'ъ':0.0008,'ё':0.0001}
    ]